module.exports.config = {
  name: "bot",
  version: "1.0.0",
  hasPermission: 0,
  credits: "𝐒𝐡𝐚𝐡𝐚𝐝𝐚𝐭 𝐈𝐬𝐥𝐚𝐦",
  description: "Random fun reply when someone says Bot",
  commandCategory: "Fun",
  usages: "[Bot]",
  cooldowns: 2,
};

const botReplies = [
"বেশি bot Bot করলে leave নিবো কিন্তু😒😒",
        "-🫵তোমারে প্রচুর ভাল্লাগে-😽-সময় মতো প্রপোজ করমু বুঝছো-🔨😼-ছিট খালি রাইখো- 🥱🐸🥵",
        "আমি আবাল দের সাথে কথা বলি না,ok😒",
        "এতো ডেকো না,প্রেম এ পরে যাবো তো🙈",
        "-বালিকা━👸-𝐃𝐨 𝐲𝐨𝐮-🫵-বিয়া-𝐦𝐞-😽-আমি তোমাকে-😻-আম্মু হইতে সাহায্য করব-🙈🥱",
        "বার বার ডাকলে মাথা গরম হয়ে যায় কিন্তু😑",
        "হ্যা বলো😒, তোমার জন্য কি করতে পারি😐😑?",
        "এতো ডাকছিস কেন?গালি শুনবি নাকি? 🤬",
        "I love you janu🥰",
        "আরে Bolo আমার জান ,কেমন আছো?😚",
       	"𝘼𝙨𝙨𝙖𝙡𝙖𝙢𝙪𝙖𝙡𝙖𝙞𝙠𝙪𝙢♥", 
        "বলেন sir__😌", 
        "𝗹𝗲𝗺𝗼𝗻 𝗷𝘂𝘀𝘀🍹",
        "𝗔𝗶 𝗻𝗲 𝗹𝗲𝗺𝗼𝗻 𝗷𝘂𝘀𝘀 🍋🍹 𝗱𝗮𝗸𝘁𝗲 𝗱𝗮𝘁𝗲 𝘁𝗼 𝗵𝗮𝗽𝗮𝘆 𝗴𝗮𝘀𝗼𝘀",
        "𝐆𝐚𝐣𝐚 𝐤𝐡𝐚 𝐦𝐚𝐧𝐮𝐬𝐡 𝐡𝐨 🍁🤡",
        "𝙇𝙚𝙢𝙤𝙣 𝙩𝙪𝙨 🍋", 
        "মুড়ি খাও 🫥", 
        ".__𝗮𝗺𝗶 𝗮𝗺𝗺𝘂𝗿 𝗸𝗮𝗰𝗵𝗲 𝗷𝗮𝗯𝗼 𝗮𝗺𝗸 𝗰𝗵𝗲𝗿𝗲 𝗱𝗮𝘄.!!🥺.....😗", 
        "লুঙ্গি টা ধর মুতে আসি🙊🙉",
        "──‎ HuM..? 👉👈", 
        "আম গাছে আম নাই ঢিল কেন মারো, তোমার সাথে প্রেম নাই বেবি কেন ডাকো 😒🐸",
        "কি হলো, মিস টিস করচ্ছো নাকি 🤣",
        "𝘽𝙤𝙡𝙤 𝙗𝙖𝙗𝙮 🥹", 
        "৮১ , ৮২ , ৮৩ আমি তোমাকে ভালবাসি",
        "আমাকে ডাকলে ,আমি কিন্তু 𝐊𝐢𝐬𝐬 করে দিব 😘",
   			];

module.exports.run = async function ({ api, event }) {
  const reply = botReplies[Math.floor(Math.random() * botReplies.length)];
  api.sendMessage(reply, event.threadID, event.messageID);
};
